Jdbc/mybatis/MyBatis_Study/WebRoot/WEB-INF/wsdl/TestWebServiceService.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3-hudson-390-. --><definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ws.com/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="TestWebServiceService" targetNamespace="http://ws.com/">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://ws.com/" schemaLocation="TestWebServiceService_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="testWs">
    <part element="tns:testWs" name="parameters"/>
  </message>
  <message name="testWsResponse">
    <part element="tns:testWsResponse" name="parameters"/>
  </message>
  <portType name="TestWebServiceDelegate">
    <operation name="testWs">
      <input message="tns:testWs"/>
      <output message="tns:testWsResponse"/>
    </operation>
  </portType>
  <binding name="TestWebServicePortBinding" type="tns:TestWebServiceDelegate">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="testWs">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="TestWebServiceService">
    <port binding="tns:TestWebServicePortBinding" name="TestWebServicePort">
      <soap:address location="http://localhost:8080/MyBatis_Study/TestWebServicePort"/>
    </port>
  </service>
</definitions>
